/////////////////////////////////////////////
// Лора
/////////////////////////////////////////////
#include <SoftwareSerial.h>
#include "EBYTE22.h"

// Введите номер канала от 1 до 65534   Должен быть уникальным! И совпадать у пульта/приемника
unsigned const int ConnectionAdress = 5;


#define PIN_TX 10
#define PIN_RX 11
#define PIN_M0 13
#define PIN_M1 12
#define PIN_AX 8

SoftwareSerial E22Serial(PIN_TX, PIN_RX, false);  // Создаем объект SoftwareSerial для соединения с модулем через программный UART

EBYTE22 E22(&E22Serial, PIN_M0, PIN_M1, PIN_AX);  // Создаем экземпляр класса EBYTE22

// Вот здесь мы cоздаем шаблон для передачи данных
struct Data {
  int xAxel = 1500;
  int yAxel = 1500;
} Data;

/////////////////////////////////////////////
// Серво
/////////////////////////////////////////////
#include <Servo.h>
Servo X_servo;
Servo Y_servo;

// Укажите пины подключения к серво c шим
int X_servoPin = 5; 
int Y_servoPin = 3; 

int x_position = 1500;
int y_position = 1500;


//////////////////////////////////////////////////////////////////////////////////////////
//                                    Сетап                                             //
//////////////////////////////////////////////////////////////////////////////////////////
void setup() {
  // Это для лоры
  Serial.begin(9600);                              // Устанавливаем соединение с компьютером (телефоном) для отладки.
  E22Serial.begin(9600);                           // Устанавливаем соединение с модулем (скорость 9600).
  Serial.println("Starting Sender");
  delay(200);

  // Это вообще штука формальная, почти не нужна, если выдаст ошибку - или модуль 32 не опознал или проверить сверху "константы для ардуино"
  if (E22.init())                          // Инициализируем модуль(конфигурируются выводы контроллера, считываются настройки модуля).
  {
    Serial.println("init OK");
  } else {
    Serial.println("init Error");
  }           // Если что-то пошло не так, выводим сообщение об ошибке.

  E22.setAddress(ConnectionAdress);         // Установим адрес модуля - 5.
  E22.writeSettings(TEMPORARY);             // Применяем настройки временно (до отключения питания)

  X_servo.attach(X_servoPin);  // подключаем сервопривод к пину
  Y_servo.attach(Y_servoPin);  // подключаем сервопривод к пину
}


//////////////////////////////////////////////////////////////////////////////////////////
//                                Основной цикл                                         //
//////////////////////////////////////////////////////////////////////////////////////////
void loop() {
  // Вот тут мы получаем данные порадиосвязи
  if (E22.available()) {
    // Если есть (E22.available() вернуло "true"), начинаем читать данные.
    E22.getStruct(&Data, sizeof(Data));
    
    // Достаем данные из структуры через data.название переменной (xAxel, yAxel) и тд.
    Serial.println(Data.xAxel);
    Serial.println(Data.yAxel);
  }
  // А вот тут надо написать взаимодействие с серво - т.е. взят данные из Data и передать их в функцию вращения серво 

  X_servo.writeMicroseconds(x_position+Data.xAxel);
  Y_servo.writeMicroseconds(y_position+Data.yAxel);
  
}
